; domain
(define (domain pacman-72)
  (:requirements :strips :typing)
  (:types position)

  (:predicates
    (at ?pos - position)
    (not_at ?pos - position)          ; complement of at
    (visited ?pos - position)
    (connected ?from ?to - position)
    (hasFood ?pos - position)
    (noFood ?pos - position)          ; complement of hasFood
    (carryingFood) 
  )

  (:action move
    :parameters (?from ?to - position)
    :precondition (and
      (at ?from)
      (not_at ?to)
      (connected ?from ?to)
    )
    :effect (and
      (at ?to)
      (not (at ?from))        ; DELETE: Pacman is no longer at ?from
      (not_at ?from)
      (visited ?to)
      (not (not_at ?to))      ; DELETE: ?to is no longer marked as not_at
    )
  )

  (:action eat
    :parameters (?pos - position)
    :precondition (and
      (at ?pos)
      (hasFood ?pos)
    )
    :effect (and
      (carryingFood)
      (noFood ?pos)
      (not (hasFood ?pos))   ; DELETE: the food is gone
    )
  )
)

; problem
(define (problem pacman-72)
    (:domain pacman-72)
    (:objects
        p00 p01 p02 p03 p04 p05 p10 p11 p12 p13 p14 p15 p20 p21 p22 p23 p24 p25 p30 p31 p32 p33 p34 p35 p40 p41 p42 p43 p44 p45 p50 p51 p52 p53 p54 p55 - position
    )

    (:init
        (not_at p00)
        (not (at p00))
        (not_at p01)
        (not (at p01))
        (not_at p02)
        (not (at p02))
        (not_at p03)
        (not (at p03))
        (not_at p04)
        (not (at p04))
        (not_at p05)
        (not (at p05))
        (not_at p10)
        (not (at p10))
        (not_at p11)
        (not (at p11))
        (not_at p12)
        (not (at p12))
        (not_at p13)
        (not (at p13))
        (at p14)
        (not (not_at p14))
        (not_at p15)
        (not (at p15))
        (not_at p20)
        (not (at p20))
        (not_at p21)
        (not (at p21))
        (not_at p22)
        (not (at p22))
        (not_at p23)
        (not (at p23))
        (not_at p24)
        (not (at p24))
        (not_at p25)
        (not (at p25))
        (not_at p30)
        (not (at p30))
        (not_at p31)
        (not (at p31))
        (not_at p32)
        (not (at p32))
        (not_at p33)
        (not (at p33))
        (not_at p34)
        (not (at p34))
        (not_at p35)
        (not (at p35))
        (not_at p40)
        (not (at p40))
        (not_at p41)
        (not (at p41))
        (not_at p42)
        (not (at p42))
        (not_at p43)
        (not (at p43))
        (not_at p44)
        (not (at p44))
        (not_at p45)
        (not (at p45))
        (not_at p50)
        (not (at p50))
        (not_at p51)
        (not (at p51))
        (not_at p52)
        (not (at p52))
        (not_at p53)
        (not (at p53))
        (not_at p54)
        (not (at p54))
        (not_at p55)
        (not (at p55))
        (noFood p00)
        (not (hasFood p00))
        (noFood p01)
        (not (hasFood p01))
        (noFood p02)
        (not (hasFood p02))
        (noFood p03)
        (not (hasFood p03))
        (hasFood p04)
        (not (noFood p04))
        (noFood p05)
        (not (hasFood p05))
        (noFood p10)
        (not (hasFood p10))
        (noFood p11)
        (not (hasFood p11))
        (noFood p12)
        (not (hasFood p12))
        (noFood p13)
        (not (hasFood p13))
        (noFood p14)
        (not (hasFood p14))
        (noFood p15)
        (not (hasFood p15))
        (noFood p20)
        (not (hasFood p20))
        (noFood p21)
        (not (hasFood p21))
        (noFood p22)
        (not (hasFood p22))
        (noFood p23)
        (not (hasFood p23))
        (hasFood p24)
        (not (noFood p24))
        (noFood p25)
        (not (hasFood p25))
        (noFood p30)
        (not (hasFood p30))
        (hasFood p31)
        (not (noFood p31))
        (noFood p32)
        (not (hasFood p32))
        (noFood p33)
        (not (hasFood p33))
        (hasFood p34)
        (not (noFood p34))
        (noFood p35)
        (not (hasFood p35))
        (noFood p40)
        (not (hasFood p40))
        (noFood p41)
        (not (hasFood p41))
        (noFood p42)
        (not (hasFood p42))
        (noFood p43)
        (not (hasFood p43))
        (noFood p44)
        (not (hasFood p44))
        (noFood p45)
        (not (hasFood p45))
        (noFood p50)
        (not (hasFood p50))
        (hasFood p51)
        (not (noFood p51))
        (noFood p52)
        (not (hasFood p52))
        (noFood p53)
        (not (hasFood p53))
        (noFood p54)
        (not (hasFood p54))
        (noFood p55)
        (not (hasFood p55))
        (connected p00 p10)
        (connected p10 p00)
        (connected p00 p01)
        (connected p01 p00)
        (connected p01 p11)
        (connected p11 p01)
        (connected p01 p02)
        (connected p02 p01)
        (connected p02 p12)
        (connected p12 p02)
        (connected p02 p03)
        (connected p03 p02)
        (connected p03 p13)
        (connected p13 p03)
        (connected p03 p04)
        (connected p04 p03)
        (connected p04 p14)
        (connected p14 p04)
        (connected p04 p05)
        (connected p05 p04)
        (connected p05 p15)
        (connected p15 p05)
        (connected p10 p20)
        (connected p20 p10)
        (connected p10 p11)
        (connected p11 p10)
        (connected p11 p21)
        (connected p21 p11)
        (connected p11 p12)
        (connected p12 p11)
        (connected p12 p22)
        (connected p22 p12)
        (connected p12 p13)
        (connected p13 p12)
        (connected p13 p23)
        (connected p23 p13)
        (connected p13 p14)
        (connected p14 p13)
        (connected p14 p24)
        (connected p24 p14)
        (connected p14 p15)
        (connected p15 p14)
        (connected p15 p25)
        (connected p25 p15)
        (connected p20 p30)
        (connected p30 p20)
        (connected p20 p21)
        (connected p21 p20)
        (connected p21 p31)
        (connected p31 p21)
        (connected p21 p22)
        (connected p22 p21)
        (connected p22 p32)
        (connected p32 p22)
        (connected p22 p23)
        (connected p23 p22)
        (connected p23 p33)
        (connected p33 p23)
        (connected p23 p24)
        (connected p24 p23)
        (connected p24 p34)
        (connected p34 p24)
        (connected p24 p25)
        (connected p25 p24)
        (connected p25 p35)
        (connected p35 p25)
        (connected p30 p40)
        (connected p40 p30)
        (connected p30 p31)
        (connected p31 p30)
        (connected p31 p41)
        (connected p41 p31)
        (connected p31 p32)
        (connected p32 p31)
        (connected p32 p42)
        (connected p42 p32)
        (connected p32 p33)
        (connected p33 p32)
        (connected p33 p43)
        (connected p43 p33)
        (connected p33 p34)
        (connected p34 p33)
        (connected p34 p44)
        (connected p44 p34)
        (connected p34 p35)
        (connected p35 p34)
        (connected p35 p45)
        (connected p45 p35)
        (connected p40 p50)
        (connected p50 p40)
        (connected p40 p41)
        (connected p41 p40)
        (connected p41 p51)
        (connected p51 p41)
        (connected p41 p42)
        (connected p42 p41)
        (connected p42 p52)
        (connected p52 p42)
        (connected p42 p43)
        (connected p43 p42)
        (connected p43 p53)
        (connected p53 p43)
        (connected p43 p44)
        (connected p44 p43)
        (connected p44 p54)
        (connected p54 p44)
        (connected p44 p45)
        (connected p45 p44)
        (connected p45 p55)
        (connected p55 p45)
        (connected p50 p51)
        (connected p51 p50)
        (connected p51 p52)
        (connected p52 p51)
        (connected p52 p53)
        (connected p53 p52)
        (connected p53 p54)
        (connected p54 p53)
        (connected p54 p55)
        (connected p55 p54)
    )

    (:goal (and
        (noFood p34)
        (noFood p31)
        (noFood p24)
        (noFood p51)
        (noFood p04)
    ))
)

; plan
1. (move p14 p04)
   deleted: (at p14) (not_at p04)
   added: (at p04) (not_at p14) (visited p04)
   goals met: 0 of 5
2. (eat p04)
   deleted: (hasfood p04)
   added: (carryingfood) (nofood p04)
   goals met: 1 of 5
3. (move p04 p14)
   deleted: (at p04) (not_at p14)
   added: (at p14) (not_at p04) (visited p14)
   goals met: 1 of 5
4. (move p14 p24)
   deleted: (at p14) (not_at p24)
   added: (at p24) (not_at p14) (visited p24)
   goals met: 1 of 5
5. (eat p24)
   deleted: (hasfood p24)
   added: (nofood p24)
   goals met: 2 of 5
6. (move p24 p34)
   deleted: (at p24) (not_at p34)
   added: (at p34) (not_at p24) (visited p34)
   goals met: 2 of 5
7. (eat p34)
   deleted: (hasfood p34)
   added: (nofood p34)
   goals met: 3 of 5
8. (move p34 p33)
   deleted: (at p34) (not_at p33)
   added: (at p33) (not_at p34) (visited p33)
   goals met: 3 of 5
9. (move p33 p32)
   deleted: (at p33) (not_at p32)
   added: (at p32) (not_at p33) (visited p32)
   goals met: 3 of 5
10. (move p32 p31)
   deleted: (at p32) (not_at p31)
   added: (at p31) (not_at p32) (visited p31)
   goals met: 3 of 5
11. (eat p31)
   deleted: (hasfood p31)
   added: (nofood p31)
   goals met: 4 of 5
12. (move p31 p41)
   deleted: (at p31) (not_at p41)
   added: (at p41) (not_at p31) (visited p41)
   goals met: 4 of 5
13. (move p41 p51)
   deleted: (at p41) (not_at p51)
   added: (at p51) (not_at p41) (visited p51)
   goals met: 4 of 5
14. (eat p51)
   deleted: (hasfood p51)
   added: (nofood p51)
   goals met: 5 of 5
